package com.example.geography;

public class TestQ {
    public static String[][] q = {
            {"З чого складається водна оболонка Землі - гідросфера?",
                    "з вод суші і Світового океану",
                    "з вод суші, Світового океану і води в атмосфері - правильно",
                    "з річок, озер, морів, боліт, ставків",
                    "тільки з вод суші"},
            {"Як називаються ділянки суші, оточені з трьох сторін водою, а з четвертого - з'єднані з нею?",
                    "материки","архіпелаги","півострова - правильно","острова"},
            {"Яка частина гідросфери не відображена на картах?",
                    "річки","моря","озера","підземні води - правильно"},
            {"Як називається безперервний процес переміщення води зі Світового океану на сушу і назад?",
                    "Світовий океан","течії","водна спільнота","Світової кругообіг води - правильно"},
            {"Яке харчування має більшість річок Росії?",
                    "снігове - правильно","дощове","льодовикове","змішане"}
    };
    public static int[] qAns = {
            2,3,4,4,1
    };
    public static boolean[][] ans = new boolean[q.length][q[0].length-1];
}
